read_verilog iiitb_aclock.v
hierarchy -check -top aclock
proc; opt; memory; opt; fsm; opt
# techmap; opt
abc -liberty ./lib/sky130_fd_sc_hd__tt_025C_1v80.lib
dfflibmap -liberty ./lib/sky130_fd_sc_hd__tt_025C_1v80.lib
show
clean
write_verilog -noattr synth.v
